df.info(): Provides a concise summary of your DataFrame, including the number of non-null entries in each column, the data type of each column, and memory usage.

df.describe(): Offers a quick statistical summary of the numerical columns in the DataFrame, such as mean, standard deviation, min, max, and quartiles.

df.head(n): Displays the first n rows of the DataFrame. By default, n is 5.

df.tail(n): Shows the last n rows of the DataFrame. Similar to head(), n defaults to 5.

df.shape: Returns a tuple representing the dimensionality of the DataFrame, i.e., the number of rows and columns.

df.columns: Lists the names of all columns in the DataFrame.

df.index: Shows the index (row labels) of the DataFrame.

df.dtypes: Returns the data types of each column.

df.nunique(): Counts the number of unique entries in each column.

df.isnull().sum(): Calculates the number of missing values in each column.

df.corr(): Computes pairwise correlation of columns, excluding NA/null values.

df.value_counts(): Returns a series containing counts of unique values for a single column.

df.groupby(): Groups data by certain criteria and allows you to apply aggregate functions like sum, mean, etc.

df.sample(n): Selects n random rows from the DataFrame. Useful for getting a quick glimpse of random entries.

df.pivot_table(): Creates a spreadsheet-style pivot table as a DataFrame.

df.plot(): Provides basic plotting of data within the DataFrame.

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("Advertising.csv")
df.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [13]:
df.sample(10)

        TV  radio  newspaper  sales
38    43.1   26.7       35.1   10.1
48   227.2   15.8       49.9   14.8
147  243.2   49.0       44.3   25.4
26   142.9   29.3       12.6   15.0
67   139.3   14.5       10.2   13.4
28   248.8   27.1       22.9   18.9
32    97.2    1.5       30.0    9.6
92   217.7   33.5       59.0   19.4
121   18.8   21.7       50.4    7.0
100  222.4    4.3       49.8   11.7

In [4]:
df.shape

(200, 4)

In [5]:
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [11]:
df.isnull().sum()

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [12]:
df.dtypes

TV           float64
radio        float64
newspaper    float64
sales        float64
dtype: object

In [7]:
df.nunique()

TV           190
radio        167
newspaper    172
sales        121
dtype: int64

In [9]:
df.value_counts()

TV     radio  newspaper  sales
0.7    39.6   8.7        1.6      1
206.9  8.4    26.4       12.9     1
197.6  3.5    5.9        11.7     1
       23.3   14.2       16.6     1
198.9  49.4   60.0       23.7     1
                                 ..
97.5   7.6    7.2        9.7      1
100.4  9.6    3.6        10.7     1
102.7  29.6   8.4        14.0     1
104.6  5.7    34.4       10.4     1
296.4  36.3   100.9      23.8     1
Length: 200, dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [10]:
df.describe()

               TV       radio   newspaper       sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000